window.PLAN_CATALOG = {
  "summer": [
    [
      "英語",
      "補強",
      "偏差値40前後",
      {
        "映像授業": 10,
        "個別指導": 10,
        "自立学習": 16
      },
      "【2学期テスト点数UPを目的としたプログラム】\n映像授業では中学校に合わせた内容を指導。各ユニットを受けたら教科書を使用（持参）し、トランス練習。個別指導では、フォレスタステップを用いて文法指導。自立学習では、スピードチェックにて単語練習、チェックテストを行います。",
      [
        "フォレスタステップ",
        "スピードチェック",
        "ニューホライズンの映像授業"
      ]
    ],
    [
      "数学",
      "補強",
      "偏差値40前後",
      {
        "個別指導": 10,
        "AI学トレ": 10,
        "自立学習": 10
      },
      "「2学期テスト点数UPを目的としたプログラム】\n個別指導では、2学期中間テストに向けて予習を実施。\nAI学トレでは、2学期中間範囲の確認コース→テスト対策コース→ハイレベルコースと演習量を増やし、様々な問題に対応する力をつけます。\n自立学習では、学校ワークを用いてテスト範囲の学習を行います。",
      [
        "パーソナル中３（未所持の場合）"
      ]
    ],
    [
      "理科",
      "補強",
      "偏差値40前後",
      {
        "映像授業": 12,
        "AI学トレ": 12,
        "自立学習": 12
      },
      "【生物・地学　復習プログラム】＊生物優先で取り組みます\n映像授業では、【中学生本科講座】にて、中１～中２の「生物・地学」をおさらい。\n自立学習では、「フォレスタステップ」を利用し、中１～中２の「生物・地学」をおさらい。\nAI学トレでは、中１～中２の「生物・地学」の基本レベルをおさらい。",
      [
        "中1理科　年間用（2025年度版）",
        "中2理科　年間用（2025年度版）",
        "※理:フォレスタステップ　[中1～3]★2025年改訂版"
      ]
    ],
    [
      "社会",
      "補強",
      "偏差値40前後",
      {
        "映像授業": 30,
        "自立学習": 10
      },
      "【2学期テスト点数UPを目的としたプログラム】\n映像授業では、歴史（明治維新～）、公民（憲法～政治）について、イメージを付かせながら秋からのテスト対策を実施。全映像終了後は修了テストを実施。そこで見つかった弱点単元を再受講します。\n自立学習では、映像授業チェックテストとマイノート作成で知識の定着を図ります。",
      [
        "中２ 社会 40 歴史Ⅱ（年間冊）",
        "中３ 社会 公民・年間用　(2021年度版)"
      ]
    ],
    [
      "国語",
      "補強",
      "偏差値40前後",
      {
        "映像授業": 10,
        "AI学トレ": 20,
        "自立学習": 10
      },
      "【国語力を向上するためのプログラム（学トレにてテスト対策も可能）】\n映像授業では、「テーマ別入試対策Ⅰ・Ⅱ」を受講します。\nAI学トレでは、映像授業での学びを活かし、問題に取り組みます。\n自立学習では、スピードチェックテストを用いて、知識面を強化します。",
      [
        "スピードチェック",
        "テーマ別入試対策Ⅰ Ⅱ"
      ]
    ],
    [
      "英語",
      "強化",
      "偏差値50前後",
      {
        "映像授業": 10,
        "個別指導": 10,
        "AI学トレ": 20
      },
      "【入試対策を目的としたプログラム】\n映像では、入試対策コース「テーマ別入試対策（不定詞特別用法まで）」を受講。\n個別指導では、夏期講座テキストを進め、疑問質問を解消します。\nAI学トレでは、映像授業、夏期講座テキストの履修単元の演習を行います。",
      [
        "夏期講座テキスト",
        "スピードチェック",
        "テーマ別入試対策ⅠⅡ"
      ]
    ],
    [
      "数学",
      "強化",
      "偏差値50前後",
      {
        "映像授業": 10,
        "個別指導": 20
      },
      "【入試対策を目的としたプログラム】\n映像授業では「テーマ別入試対策Ⅰ・Ⅱ」を受講。\n個別指導では、夏期講座テキストの標準レベルまでを優先して学習。単元内容を思い出すことと、入試レベルまで実力を引き上げます。",
      [
        "テーマ別入試対策Ⅰ・Ⅱ",
        "夏期講座テキスト"
      ]
    ],
    [
      "理科",
      "強化",
      "偏差値50前後",
      {
        "映像授業": 12,
        "AI学トレ": 12,
        "自立学習": 12
      },
      "【物理・化学　復習プログラム】*化学優先で取り組みます\n映像授業では、【中学生本科講座】にて、中１～中２の「物理・化学」をおさらい。\n自立学習では、「スピードチェック」を利用し、中１～中２の「物理・化学」をおさらい。\nAI学トレでは、中１～中２の「物理・化学」の確認レベルをおさらい。",
      [
        "スピードチェック",
        "中1理科　年間用（2025年度版）",
        "中2理科　年間用（2025年度版）"
      ]
    ],
    [
      "社会",
      "強化",
      "偏差値50前後",
      {
        "映像授業": 30,
        "自立学習": 10
      },
      "【入試対策を目的としたプログラム】\n映像授業では、中１～２内容から抜粋して地理、歴史について、イメージを付かせながら学習し直します。\n自立学習では、マイノート作成と映像授業チェックテストを用い、これまでの学びの復習を行います。",
      [
        "中１ 社会 30 歴史Ⅰ（年間冊）",
        "中１ 社会 地理Ⅰ　年間用（標準）",
        "中２ 社会 40 歴史Ⅱ（年間冊）",
        "中２ 社会 地理Ⅱ・年間用（標準）"
      ]
    ],
    [
      "国語",
      "強化",
      "偏差値50前後",
      {
        "映像授業": 10,
        "AI学トレ": 20,
        "自立学習": 10
      },
      "【入試に向けた国語力を向上するためのプログラム】\n映像授業では、「テーマ別入試対策Ⅰ・Ⅱ」を受講します。\nAI学トレでは、映像授業での学びを活かし、問題に取り組みます。\n自立学習では、スピードチェックテストを用いて、知識面を強化します。",
      [
        "スピードチェック",
        "テーマ別入試対策Ⅰ Ⅱ"
      ]
    ],
    [
      "英語",
      "特化",
      "偏差値60前後",
      {
        "映像授業": 10,
        "個別指導": 5,
        "AI学トレ": 25
      },
      "【入試対策を目的としたプログラム】\n映像授業では、「テーマ別入試対策（不定詞特別用法まで）」を受講します。\n個別指導では、夏期講座テキストの発展レベルまで取り組みます。\nAI学トレでは、映像授業と夏期講座テキストで履修した単元を演習します。",
      [
        "夏期講座テキスト",
        "テーマ別入試対策ⅠⅡ"
      ]
    ],
    [
      "数学",
      "特化",
      "偏差値60前後",
      {
        "映像授業": 10,
        "個別指導": 10,
        "AI学トレ": 20
      },
      "【入試対策を目的としたプログラム】\n映像授業では、「テーマ別入試対策Ⅰ・Ⅱ」を受講します。\n個別指導では、夏期講座テキストの発展レベルまで取り組みます。\nAI学トレでは、方程式の利用、比例反比例の融合、円とおうぎ形、空間図形、データの活用、連立方程式の利用、一次関数の利用、平行線と多角形、確率、箱ひげ図など、の高度な問題に取り組みます。",
      [
        "夏期講座テキスト",
        "テーマ別入試対策Ⅰ・Ⅱ"
      ]
    ],
    [
      "理科",
      "特化",
      "偏差値60前後",
      {
        "映像授業": 12,
        "AI学トレ": 16,
        "自立学習": 8
      },
      "【ハイレベル入試対策プログラム】\n映像授業では「テーマ別入試対策Ⅰ・Ⅱ」を受講します。\n自立学習では、「夏期講座テキスト（発展内容まで演習）」のペースメイク・定着確認をします。\nAI学トレでは、中1～中3の1学期までの「単元のまとめ」の、ハイレベル問題に取り組みます。",
      [
        "テーマ別入試対策Ⅰ(理科)",
        "テーマ別入試対策Ⅱ(理科)",
        "夏期講座テキスト"
      ]
    ],
    [
      "社会",
      "特化",
      "偏差値60前後",
      {
        "映像授業": 10,
        "AI学トレ": 10,
        "自立学習": 10
      },
      "【入試対策を目的としたプログラム】\n映像授業では「テーマ別入試対策Ⅰ～Ⅲ」より抜粋して取り組みます。\nAI学トレでは地理と歴史の知識の確認と増強を行います。\n自立学習ではマイノート作成と映像授業チェックテストを用い、定着度を確認していきます。",
      [
        "中３ 社会 テーマ別入試対策Ⅰ(社会)新版",
        "中３ 社会 テーマ別入試対策Ⅱ(社会)新版",
        "中３ 社会 テーマ別入試対策Ⅲ(社会)新版"
      ]
    ],
    [
      "国語",
      "特化",
      "偏差値60前後",
      {
        "映像授業": 10,
        "AI学トレ": 20,
        "自立学習": 10
      },
      "【入試に向けた国語力を向上するため、より高度な問題に取り組むプログラム】\n映像授業では、「テーマ別入試対策Ⅰ・Ⅱ」を受講します。\nAI学トレでは、映像授業での学びを活かし、より高度な問題に取り組みます。\n自立学習では、スピードチェックテストを用いて、知識面を強化します。",
      [
        "スピードチェック",
        "テーマ別入試対策Ⅰ Ⅱ"
      ]
    ]
  ],
  "winter": [
    [
      "英語",
      "補強",
      "偏差値40前後",
      {
        "個別指導": 8,
        "AI学トレ": 4,
        "自立学習": 8
      },
      "個別指導では「分詞と間接疑問文」「関係代名詞」「仮定法」を重点的に指導します。\n自立学習では「連語」の単元を反復演習をします。「訳せる」→「書ける」の順でテストします。\nAI学トレではベーシックコースで関係代名詞を行います。",
      [
        "フォレスタステップ",
        "スピードチェック（入試対策プログラム未熟考生徒）"
      ]
    ],
    [
      "数学",
      "補強",
      "偏差値40前後",
      {
        "個別指導": 10,
        "AI学トレ": 10
      },
      "個別指導では土日本科テキストの基本問題に絞り、質問対応を実施します。\n学トレでは、中学内容を総復習や中２・中３の単元のまとめを学習します。",
      [
        "土日本科テキスト（入試対策プログラムのPコースを未受講の生徒）"
      ]
    ],
    [
      "理科",
      "補強",
      "偏差値40前後",
      {
        "映像授業": 8,
        "個別指導": 4,
        "自立学習": 8
      },
      "個別指導では、フォレスタステップに取り組みます。また、私立高校の過去問・映像授業テキストの質問対応を行います。（私立の過去問は書店にてご家庭で準備いただきます）\n映像授業では、2学期内容の復習に取り組みます。\n自立学習では、スピードチェックの進捗確認、チェックテストを行います。",
      [
        "スピードチェックVOL2（ない場合はVOL1でも可能）",
        "理科・中３・年間用（映像）",
        "私立高校の過去問（ご家庭で購入）",
        "フォレスタステップ"
      ]
    ],
    [
      "社会",
      "補強",
      "偏差値40前後",
      {
        "映像授業": 8,
        "AI学トレ": 8,
        "自立学習": 4
      },
      "年明けのテストが内申に影響する地域は、公民の「政治分野」を中心に映像授業で復習、AI学トレで問題演習を行います。自立学習は「映像授業のテスト」と「スピードチェックテスト」を実施。\n※テストのメイン範囲が「経済分野」あるいは歴史、地理中心になる場合はご相談ください。",
      [
        "映像授業　公民（年間冊）",
        "スピードチェックvol.2"
      ]
    ],
    [
      "国語",
      "補強",
      "偏差値40前後",
      {
        "映像授業": 3,
        "AI学トレ": 9,
        "自立学習": 8
      },
      "入試問題の解き方を総合的に取り組みます。\n映像授業で入試対策、AI学トレで実践演習、自立学習で基礎知識の定着を目指します。",
      [
        "テーマ別入試Ⅳ"
      ]
    ],
    [
      "英語",
      "強化",
      "偏差値50前後",
      {
        "映像授業": 10,
        "個別指導": 5,
        "自立学習": 5
      },
      "個別指導では、土日テキストの標準問題（4～7）に取り組み、質問対応を行います。\n自立学習では、連語の単元に取り組みます。\n映像授業では、テーマ別入試対策Ⅲ（関係詞～対話分まで）にて学習します。",
      [
        "土日本科テキスト（入試対策プログラムのPコース未受講生徒）",
        "テーマ別入試対策Ⅲ",
        "スピードチェック（入試対策プログラム未受講生徒）"
      ]
    ],
    [
      "数学",
      "強化",
      "偏差値50前後",
      {
        "映像授業": 10,
        "個別指導": 10
      },
      "個別指導では、夏期テキストまたは土日本科テキストの質問対応を実施します。（いずれのテキストも未所持の場合は土日本科テキストを購入いただきます)\n映像授業では、入試対策シリーズのテーマ別入試対策Ⅲ・Ⅳを実施します。",
      [
        "土日本科テキスト（入試対策プログラムのPコース未受講生徒）",
        "入試対策シリーズのテーマ別入試対策（標準ではないほう）のⅢ・Ⅳ"
      ]
    ],
    [
      "理科",
      "強化",
      "偏差値50前後",
      {
        "映像授業": 8,
        "個別指導": 4,
        "AI学トレ": 8
      },
      "個別指導では、土日本科テキストの質問対応、進捗確認を行います。私立高校の過去問・映像授業テキストの質問対応も行います。（私立の過去問は書店にてご家庭で準備いただきます）\n映像授業では、2学期内容の復習に取り組みます。\nAI学トレでは、2学期内容の復習として、確認コース→テスト対策→アチーブメントテスト→模擬テストの順に取り組みます。",
      [
        "土日本科テキスト",
        "理科・中３・年間用（映像）"
      ]
    ],
    [
      "社会",
      "強化",
      "偏差値50前後",
      {
        "映像授業": 6,
        "AI学トレ": 8,
        "自立学習": 6
      },
      "映像授業では「テーマ別入試対策IV」で、直前演習を行います。※入試対策プログラムで受講済の場合は、過去に受講した映像の再視聴も可能です。\n自立学習は「映像授業のテスト」と「スピードチェックテスト」を実施。\nAI学トレでは、地理・歴史・公民分野で自分の苦手単元を選択して補強します。",
      [
        "テーマ別入試対策Ⅳ（新版）／改訂",
        "スピードチェックvol.1／vol.2"
      ]
    ],
    [
      "国語",
      "強化",
      "偏差値50前後",
      {
        "映像授業": 3,
        "AI学トレ": 17
      },
      "映像授業で入試対策の授業を行い総合力を身に着けます。\nまた、AI学トレで実践的な練習を行います。",
      [
        "テーマ別入試Ⅳ"
      ]
    ],
    [
      "英語",
      "特化",
      "偏差値60前後",
      {
        "個別指導": 5,
        "AI学トレ": 15
      },
      "個別指導では、冬期テキストに取り組み、質問対応を行います。\nAI学トレでは、後置修飾（分詞、関係代名詞）から始め、弱点単元にも取り組みます。",
      [
        "冬期テキスト"
      ]
    ],
    [
      "数学",
      "特化",
      "偏差値60前後",
      {
        "映像授業": 10,
        "個別指導": 10
      },
      "個別指導では、冬期テキストの質問対応を実施します。\nまずは基本問題を優先して実施します。その後、標準問題を実施し、実力アップを目指します。\n映像授業では、入試対策シリーズのテーマ別入試対策Ⅲ・Ⅳを実施します。",
      [
        "冬期テキスト",
        "入試対策シリーズのテーマ別入試対策（標準ではないほう）のⅢ・Ⅳ"
      ]
    ],
    [
      "理科",
      "特化",
      "偏差値60前後",
      {
        "映像授業": 8,
        "個別指導": 4,
        "AI学トレ": 8
      },
      "個別指導では、土日本科テキストの質問対応、進捗確認を行います。私立高校の過去問・映像授業テキストの質問対応も行います。（私立の過去問は書店にてご家庭で準備いただきます）\n映像授業では「テーマ別入試対策シリーズ」に取り組みます。\nAI学トレでは、２学期内容の復習として、テスト対策→アチーブメント→模擬テスト→ハイレベルの順に取り組みます。",
      [
        "土日本科テキスト",
        "「テーマ別入試対策シリーズ」（入試対策プログラムで受講していないものから選択"
      ]
    ],
    [
      "社会",
      "特化",
      "偏差値60前後",
      {
        "映像授業": 6,
        "AI学トレ": 10,
        "自立学習": 4
      },
      "映像授業では、「テーマ別入試対策IV」で、直前演習を行います。※入試対策プログラムで受講済の場合は、過去に受講した映像の再視聴も可能です。\n自立学習は「映像授業のテスト」と「スピードチェックテスト」を実施。\nAI学トレでは、MEや入試直前シリーズで実践演習を繰り返します。",
      [
        "テーマ別入試対策Ⅳ（新版）／改訂",
        "スピードチェックvol.1／vol.2"
      ]
    ],
    [
      "国語",
      "特化",
      "偏差値60前後",
      {
        "映像授業": 3,
        "AI学トレ": 17
      },
      "映像授業で入試対策の授業を行い総合力を身に着けます。\nまた、AI学トレで実践的な練習を行います。",
      [
        "テーマ別入試Ⅳ"
      ]
    ]
  ],
  "recommendation": [
    [
      "英語",
      "私立推薦対策",
      "推薦入試受験者向け",
      {
        "個別指導": 8
      },
      "私立高校の過去問対応を実施します。\n（私立の過去問は書店にてご家庭で準備いただきます）",
      [
        "私立高校の過去問（ご家庭で購入）"
      ]
    ],
    [
      "数学",
      "私立推薦対策",
      "推薦入試受験者向け",
      {
        "個別指導": 8
      },
      "私立高校の過去問対応を実施します。\n（私立の過去問は書店にてご家庭で準備いただきます）",
      [
        "私立高校の過去問（ご家庭で購入）"
      ]
    ],
    [
      "国語",
      "私立推薦対策",
      "推薦入試受験者向け",
      {
        "映像授業": 3,
        "AI学トレ": 9,
        "自立学習": 8
      },
      "入試問題の解き方を総合的に取り組みます。\n映像授業で入試対策、AI学トレで実践演習、自立学習で基礎知識の定着を目指します。",
      [
        "テーマ別入試Ⅳ"
      ]
    ]
  ],
  "notes": {
    "recommendation": [
      "教材費は別途になる場合があります。",
      "複数の教科をお選びいただけます。",
      "受講費は講座期間終了後、毎月の授業料と同時に請求いたします。",
      "申し込みの際は【冬期講座】と記載のあるプランの中から選択してください。",
      "現在、平日本科・個別指導・自立学習・力シリーズ各種を受講していないお子さんは、『映像授業』は正規料金（2,200円/回）となります。",
      "現在、平日本科・個別指導・自立学習・映像授業・力シリーズ各種を受講していないお子さんは、『AI学トレ』は正規料金（1,320円/回）となります。"
    ],
    "winter": [
      "教材費は別途になる場合があります。",
      "複数の教科をお選びいただけます。",
      "受講費は講座期間終了後、毎月の授業料と同時に請求いたします。",
      "申し込みの際は【冬期講座】と記載のあるプランの中から選択してください。",
      "現在、平日本科・個別指導・自立学習・力シリーズ各種を受講していないお子さんは、『映像授業』は正規料金（2,200円/回）となります。",
      "現在、平日本科・個別指導・自立学習・映像授業・力シリーズ各種を受講していないお子さんは、『AI学トレ』は正規料金（1,320円/回）となります。"
    ],
    "summer": [
      "教材費は別途になる場合があります。",
      "複数の教科をお選びいただけます。",
      "受講費は講座期間終了後、毎月の授業料と同時に請求いたします。",
      "申し込みの際は【夏期講座】と記載のあるプランの中から選択してください。",
      "現在、平日本科、個別指導、自立学習、力シリーズ各種を受講していないお子さんは、『映像授業』は正規料金（2,200円/回）となります。",
      "現在、平日本科・個別指導・自立学習・映像授業・力シリーズ各種を受講していないお子さんは、『AI学トレ』は正規料金（1,320円/回）となります。"
    ]
  }
};
